[Killed] BlockStatement
main/components/RequestType/RequestTypeTable.js:15:34
 export default function RequestTypeTable({ requestTypes, currentUser }) {
   const navigate = useNavigate();
 
-  const editCallback = (cell) => {
-    navigate(`/requestTypes/edit/${cell.row.values.id}`);
-  };
+  const editCallback = (cell) => {};
 
   // Stryker disable all : hard to test for query caching
killedBy: UserTable tests edit button navigates to the edit page for admin user
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/requestTypes/edit/1"

Number of calls: 0

Ignored nodes: comments, script, style
<html>

[Killed] BlockStatement
main/components/RequestType/RequestTypeTable.js:47:5
   if (
     hasRole(currentUser, "ROLE_ADMIN") ||
     hasRole(currentUser, "ROLE_PROFESSOR")
-  ) {
-    columns.push(
-      ButtonColumn("Edit", "primary", editCallback, "RequestTypeTable"),
-    );
-    columns.push(
-      ButtonColumn("Delete", "danger", deleteCallback, "RequestTypeTable"),
-    );
-  }
+  ) {}
 
   return (
killedBy: UserTable tests has the expected column headers and content for admin user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="RequestTypeTable-cell-row-0-col-Edit-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
