[Killed] LogicalOperator
main/components/Nav/AppNavbar.js:52:16
 
           <Navbar.Collapse className="justify-content-between">
             <Nav className="mr-auto">
-              {hasRole(currentUser, "ROLE_ADMIN") && (
-                <NavDropdown
-                  title="Admin"
-                  id="appnavbar-admin-dropdown"
-                  data-testid="appnavbar-admin-dropdown"
-                >
-                  <NavDropdown.Item href="/admin/users">Users</NavDropdown.Item>
-                  <NavDropdown.Item href="/admin/requests">
-                    Requests
-                  </NavDropdown.Item>
-                </NavDropdown>
-              )}
+              {hasRole(currentUser, "ROLE_ADMIN") || <NavDropdown title="Admin" id="appnavbar-admin-dropdown" data-testid="appnavbar-admin-dropdown">
+                  <NavDropdown.Item href="/admin/users">Users</NavDropdown.Item>
+                  <NavDropdown.Item href="/admin/requests">
+                    Requests
+                  </NavDropdown.Item>
+                </NavDropdown>}
               {(hasRole(currentUser, "ROLE_ADMIN") ||
                 hasRole(currentUser, "ROLE_PROFESSOR")) && (
killedBy: AppNavbar tests renders correctly for admin user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="appnavbar-admin-dropdown"]

Ignored nodes: comments, script, style
<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark bg-dark sticky-top"
      data-testid="AppNavbar"

[Killed] ConditionalExpression
main/components/Nav/AppNavbar.js:52:16
 
           <Navbar.Collapse className="justify-content-between">
             <Nav className="mr-auto">
-              {hasRole(currentUser, "ROLE_ADMIN") && (
-                <NavDropdown
-                  title="Admin"
-                  id="appnavbar-admin-dropdown"
-                  data-testid="appnavbar-admin-dropdown"
-                >
-                  <NavDropdown.Item href="/admin/users">Users</NavDropdown.Item>
-                  <NavDropdown.Item href="/admin/requests">
-                    Requests
-                  </NavDropdown.Item>
-                </NavDropdown>
-              )}
+              {true}
               {(hasRole(currentUser, "ROLE_ADMIN") ||
                 hasRole(currentUser, "ROLE_PROFESSOR")) && (
killedBy: AppNavbar tests renders correctly for admin user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="appnavbar-admin-dropdown"]

Ignored nodes: comments, script, style
<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark bg-dark sticky-top"
      data-testid="AppNavbar"

[Killed] ConditionalExpression
main/components/Nav/AppNavbar.js:64:17
                   </NavDropdown.Item>
                 </NavDropdown>
               )}
-              {(hasRole(currentUser, "ROLE_ADMIN") ||
-                hasRole(currentUser, "ROLE_PROFESSOR")) && (
+              {(true) && (
                 <>
                   <Nav.Link as={Link} to="/settings">
killedBy: AppNavbar tests the three prof pages do not show for normal users
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <a class="nav-link" href="/settings">Settings</a> instead

[Killed] ConditionalExpression
main/components/Nav/AppNavbar.js:64:16
                   </NavDropdown.Item>
                 </NavDropdown>
               )}
-              {(hasRole(currentUser, "ROLE_ADMIN") ||
-                hasRole(currentUser, "ROLE_PROFESSOR")) && (
-                <>
-                  <Nav.Link as={Link} to="/settings">
-                    Settings
-                  </Nav.Link>
-                </>
-              )}
+              {true}
               {(hasRole(currentUser, "ROLE_PROFESSOR") ||
                 hasRole(currentUser, "ROLE_STUDENT")) && (
killedBy: AppNavbar tests renders correctly for admin user
statusReason: TestingLibraryElementError: Unable to find an element with the text: Settings. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark bg-dark sticky-top"
      data-testid="AppN

[Killed] ConditionalExpression
main/components/Nav/AppNavbar.js:72:17
                   </Nav.Link>
                 </>
               )}
-              {(hasRole(currentUser, "ROLE_PROFESSOR") ||
-                hasRole(currentUser, "ROLE_STUDENT")) && (
+              {(true) && (
                 <>
                   <Nav.Link as={Link} to="/requests/pending">
killedBy: AppNavbar tests the three prof pages do not show for normal users
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <a class="nav-link" href="/requests/pending">Pending Requests</a> instead

[Killed] LogicalOperator
main/components/Nav/AppNavbar.js:72:17
                   </Nav.Link>
                 </>
               )}
-              {(hasRole(currentUser, "ROLE_PROFESSOR") ||
-                hasRole(currentUser, "ROLE_STUDENT")) && (
+              {(hasRole(currentUser, "ROLE_PROFESSOR") && hasRole(currentUser, "ROLE_STUDENT")) && (
                 <>
                   <Nav.Link as={Link} to="/requests/pending">
killedBy: AppNavbar tests renders the three prof pages correctly for professor users
statusReason: Error: Unable to find an element with the text: Pending Requests. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark bg-dark sticky-top"
      data-testid="AppNavbar"

[Killed] ConditionalExpression
main/components/Nav/AppNavbar.js:86:16
                   </Nav.Link>
                 </>
               )}
-              {hasRole(currentUser, "ROLE_STUDENT") && (
-                <>
-                  <Nav.Link as={Link} to="/requests">
-                    My Requests
-                  </Nav.Link>
-                </>
-              )}
+              {false}
             </Nav>
 
killedBy: AppNavbar tests renders the three prof pages correctly for student users
statusReason: Error: Unable to find an element with the text: My Requests. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark bg-dark sticky-top"
      data-testid="AppNavbar"

[Killed] ConditionalExpression
main/components/Nav/AppNavbar.js:86:16
                   </Nav.Link>
                 </>
               )}
-              {hasRole(currentUser, "ROLE_STUDENT") && (
-                <>
-                  <Nav.Link as={Link} to="/requests">
-                    My Requests
-                  </Nav.Link>
-                </>
-              )}
+              {true}
             </Nav>
 
killedBy: AppNavbar tests renders the three prof pages correctly for student users
statusReason: Error: Unable to find an element with the text: My Requests. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark bg-dark sticky-top"
      data-testid="AppNavbar"
