[Killed] BlockStatement
main/pages/RequestTypes/RequestTypesCreatePage.js:3:50
 import BasicLayout from "main/layouts/BasicLayout/BasicLayout";
 
-export default function RequestTypesCreatePage() {
-  // Stryker disable all : placeholder for future implementation
-  return (
-    <BasicLayout>
-      <div className="pt-2">
-        <h1>Request Types Create page not yet implemented</h1>
-      </div>
-    </BasicLayout>
-  );
-}
+export default function RequestTypesCreatePage() {}
 
killedBy: RequestTypesCreatePage tests Renders expected content
statusReason: Error: Unable to find an element with the text: Request Types Create page not yet implemented. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>
