[Killed] ArrayDeclaration
main/components/RecommendationRequest/RecommendationRequestForm.js:11:19
   submitAction,
   buttonLabel = "Create",
   recommendationTypeVals = [],
-  professorVals = [],
+  professorVals = ["Stryker was here"],
 }) {
   // Stryker disable all
killedBy: RecommendationRequestForm tests that the initial value of professors and recommendationTypes is only defaults
statusReason: TestingLibraryElementError: Unable to find an element with the text: No professors available. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] BlockStatement
main/components/RecommendationRequest/RecommendationRequestForm.js:51:30
     getRequestTypes();
   });
 
-  const onSubmit = (data) => {
-    if (/^\d{4}-\d{2}-\d{2}$/.test(data.dueDate)) {
-      data.dueDate = data.dueDate + "T00:00:00";
-    }
-    submitAction(data);
-  };
+  const onSubmit = (data) => {};
 
   const navigate = useNavigate();
killedBy: RecommendationRequestForm tests submitAction is called with correctly formatted dueDate
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"dueDate": "2025-05-18T00:00:00"}

Number of calls: 0

Ignored nodes: comments, script, style
<html>

[Killed] BlockStatement
main/components/RecommendationRequest/RecommendationRequestForm.js:52:51
   });
 
   const onSubmit = (data) => {
-    if (/^\d{4}-\d{2}-\d{2}$/.test(data.dueDate)) {
-      data.dueDate = data.dueDate + "T00:00:00";
-    }
+    if (/^\d{4}-\d{2}-\d{2}$/.test(data.dueDate)) {}
     submitAction(data);
   };
killedBy: RecommendationRequestForm tests submitAction is called with correctly formatted dueDate
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"dueDate": "2025-05-18T00:00:00"}
Received: {"details": "Test details", "dueDate": "2025-05-18", "id": 1, "professor_id": "1", "recommendationType": "Other"}

Number of calls: 1

Ignored nodes: comments, script, style

[Killed] ConditionalExpression
main/components/RecommendationRequest/RecommendationRequestForm.js:52:9
   });
 
   const onSubmit = (data) => {
-    if (/^\d{4}-\d{2}-\d{2}$/.test(data.dueDate)) {
+    if (false) {
       data.dueDate = data.dueDate + "T00:00:00";
     }
killedBy: RecommendationRequestForm tests submitAction is called with correctly formatted dueDate
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"dueDate": "2025-05-18T00:00:00"}
Received: {"details": "Test details", "dueDate": "2025-05-18", "id": 1, "professor_id": "1", "recommendationType": "Other"}

Number of calls: 1

Ignored nodes: comments, script, style

[Killed] StringLiteral
main/components/RecommendationRequest/RecommendationRequestForm.js:53:37
 
   const onSubmit = (data) => {
     if (/^\d{4}-\d{2}-\d{2}$/.test(data.dueDate)) {
-      data.dueDate = data.dueDate + "T00:00:00";
+      data.dueDate = data.dueDate + "";
     }
     submitAction(data);
killedBy: RecommendationRequestForm tests submitAction is called with correctly formatted dueDate
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"dueDate": "2025-05-18T00:00:00"}
Received: {"details": "Test details", "dueDate": "2025-05-18", "id": 1, "professor_id": "1", "recommendationType": "Other"}

Number of calls: 1

Ignored nodes: comments, script, style

[Killed] ObjectLiteral
main/components/RecommendationRequest/RecommendationRequestForm.js:91:44
               id="professor_id"
               type="string"
               isInvalid={Boolean(errors.professor_id)}
-              {...register("professor_id", {
-                required: "Please select a professor",
-              })}
+              {...register("professor_id", {})}
               defaultValue=""
             >
killedBy: RecommendationRequestForm tests that the correct validations are performed
statusReason: Error: Unable to find an element with the text: /Please select a professor/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/RecommendationRequest/RecommendationRequestForm.js:92:27
               type="string"
               isInvalid={Boolean(errors.professor_id)}
               {...register("professor_id", {
-                required: "Please select a professor",
+                required: "",
               })}
               defaultValue=""
killedBy: RecommendationRequestForm tests that the correct validations are performed
statusReason: Error: Unable to find an element with the text: /Please select a professor/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ConditionalExpression
main/components/RecommendationRequest/RecommendationRequestForm.js:96:16
               })}
               defaultValue=""
             >
-              {Array.isArray(professors) && professors.length > 0 ? (
+              {false ? (
                 <>
                   <option disabled value="">
killedBy: StudentProfileEditPage tests tests where backend is working normally Is populated with the data provided and submits updated data
statusReason: Error: Unable to find an element with the display value: Craig Zzyxx.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ConditionalExpression
main/components/RecommendationRequest/RecommendationRequestForm.js:113:14
                 </option>
               )}
             </Form.Select>
-            {errors.professor_id && (
-              <Form.Control.Feedback type="invalid">
-                {errors.professor_id.message}
-              </Form.Control.Feedback>
-            )}
+            {true}
           </Form.Group>
         </Col>
killedBy: RecommendationRequestForm tests that the correct validations are performed
statusReason: Error: Unable to find an element with the text: /Please select a professor/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ConditionalExpression
main/components/RecommendationRequest/RecommendationRequestForm.js:113:14
                 </option>
               )}
             </Form.Select>
-            {errors.professor_id && (
-              <Form.Control.Feedback type="invalid">
-                {errors.professor_id.message}
-              </Form.Control.Feedback>
-            )}
+            {false}
           </Form.Group>
         </Col>
killedBy: RecommendationRequestForm tests that the correct validations are performed
statusReason: Error: Unable to find an element with the text: /Please select a professor/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ConditionalExpression
main/components/RecommendationRequest/RecommendationRequestForm.js:138:16
               })}
               defaultValue=""
             >
-              {Array.isArray(recommendationTypes) &&
-              recommendationTypes.length > 0 ? (
+              {true ? (
                 <>
                   <option disabled value="">
killedBy: StudentProfileEditPage tests tests where backend is working normally Is populated with the data provided and submits updated data
statusReason: Error: expect(element).toHaveValue(Other)

Expected the element to have value:
  Other
Received:
  CS Department BS/MS program

[Killed] EqualityOperator
main/components/RecommendationRequest/RecommendationRequestForm.js:139:15
               defaultValue=""
             >
               {Array.isArray(recommendationTypes) &&
-              recommendationTypes.length > 0 ? (
+              recommendationTypes.length >= 0 ? (
                 <>
                   <option disabled value="">
killedBy: RecommendationRequestForm tests that the initial value of professors and recommendationTypes is only defaults
statusReason: TestingLibraryElementError: Unable to find an element with the text: No recommendation types available, use Other in details. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] LogicalOperator
main/components/RecommendationRequest/RecommendationRequestForm.js:160:14
               )}
               <option value="Other">Other</option>
             </Form.Select>
-            {errors.recommendationType && (
-              <Form.Control.Feedback type="invalid">
-                {errors.recommendationType.message}
-              </Form.Control.Feedback>
-            )}
+            {errors.recommendationType || <Form.Control.Feedback type="invalid">
+                {errors.recommendationType.message}
+              </Form.Control.Feedback>}
           </Form.Group>
         </Col>
killedBy: RecommendationRequestForm tests renders correctly with no initialContents
statusReason: TypeError: Cannot read properties of undefined (reading 'message')

[Killed] ConditionalExpression
main/components/RecommendationRequest/RecommendationRequestForm.js:160:14
               )}
               <option value="Other">Other</option>
             </Form.Select>
-            {errors.recommendationType && (
-              <Form.Control.Feedback type="invalid">
-                {errors.recommendationType.message}
-              </Form.Control.Feedback>
-            )}
+            {false}
           </Form.Group>
         </Col>
killedBy: RecommendationRequestForm tests that the correct validations are performed
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Please select a recommendation type/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ConditionalExpression
main/components/RecommendationRequest/RecommendationRequestForm.js:196:14
                 required: "Please select a due date",
               })}
             />
-            {errors.dueDate && (
-              <Form.Control.Feedback type="invalid">
-                {errors.dueDate.message}
-              </Form.Control.Feedback>
-            )}
+            {true}
           </Form.Group>
         </Col>
killedBy: RecommendationRequestForm tests that the correct validations are performed
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Please select a due date/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] LogicalOperator
main/components/RecommendationRequest/RecommendationRequestForm.js:196:14
                 required: "Please select a due date",
               })}
             />
-            {errors.dueDate && (
-              <Form.Control.Feedback type="invalid">
-                {errors.dueDate.message}
-              </Form.Control.Feedback>
-            )}
+            {errors.dueDate || <Form.Control.Feedback type="invalid">
+                {errors.dueDate.message}
+              </Form.Control.Feedback>}
           </Form.Group>
         </Col>
killedBy: RecommendationRequestForm tests renders correctly with no initialContents
statusReason: TypeError: Cannot read properties of undefined (reading 'message')
