[Killed] LogicalOperator
main/pages/StudentProfile/StudentProfileEditPage.js:67:10
     <BasicLayout>
       <div className="pt-2">
         <h1>Edit Recommendation Request</h1>
-        {recommendationrequests && (
-          <RecommendationRequestForm
-            submitAction={onSubmit}
-            buttonLabel={"Update"}
-            initialContents={{
-              ...recommendationrequests,
-              professor_id: recommendationrequests.professor?.id,
-              dueDate: recommendationrequests.dueDate.substring(0, 10),
-            }}
-          />
-        )}
+        {recommendationrequests || <RecommendationRequestForm submitAction={onSubmit} buttonLabel={"Update"} initialContents={{
+  ...recommendationrequests,
+  professor_id: recommendationrequests.professor?.id,
+  dueDate: recommendationrequests.dueDate.substring(0, 10)
+}} />}
       </div>
     </BasicLayout>
killedBy: StudentProfileEditPage tests when the backend doesn't return data renders header but table is not present
statusReason: TypeError: Cannot read properties of undefined (reading 'professor')

[Killed] ConditionalExpression
main/pages/StudentProfile/StudentProfileEditPage.js:67:10
     <BasicLayout>
       <div className="pt-2">
         <h1>Edit Recommendation Request</h1>
-        {recommendationrequests && (
-          <RecommendationRequestForm
-            submitAction={onSubmit}
-            buttonLabel={"Update"}
-            initialContents={{
-              ...recommendationrequests,
-              professor_id: recommendationrequests.professor?.id,
-              dueDate: recommendationrequests.dueDate.substring(0, 10),
-            }}
-          />
-        )}
+        {false}
       </div>
     </BasicLayout>
killedBy: StudentProfileEditPage tests tests where backend is working normally Is populated with the data provided and submits updated data
statusReason: Error: Unable to find an element with the display value: Craig Zzyxx.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Survived] OptionalChaining
main/pages/StudentProfile/StudentProfileEditPage.js:73:29
             buttonLabel={"Update"}
             initialContents={{
               ...recommendationrequests,
-              professor_id: recommendationrequests.professor?.id,
+              professor_id: recommendationrequests.professor.id,
               dueDate: recommendationrequests.dueDate.substring(0, 10),
             }}

[Killed] MethodExpression
main/pages/StudentProfile/StudentProfileEditPage.js:74:24
             initialContents={{
               ...recommendationrequests,
               professor_id: recommendationrequests.professor?.id,
-              dueDate: recommendationrequests.dueDate.substring(0, 10),
+              dueDate: recommendationrequests.dueDate,
             }}
           />
killedBy: StudentProfileEditPage tests tests where backend is working normally Is populated with the data provided and submits updated data
statusReason: Error: expect(element).toHaveValue(2025-06-01)

Expected the element to have value:
  2025-06-01
Received:
