[Killed] BlockStatement
main/components/RecommendationRequest/RecommendationRequestForm.js:34:19
   );
 
   //queries endpoint to get list of professors
-  useEffect(() => {
-    const getProfessors = async () => {
-      try {
-        const response = await fetch("/api/admin/users/professors");
-        const data = await response.json();
-        setProfessors(data);
-      } catch (error) {
-        console.error("Error fetching professors");
-      }
-    };
-    const getRequestTypes = async () => {
-      try {
-        const response = await fetch("/api/requesttypes/all");
-        const data = await response.json();
-        setRecommendationTypes(data);
-      } catch (error) {
-        console.error("Error fetching request types");
-      }
-    };
-
-    getProfessors();
-    getRequestTypes();
-  });
+  useEffect(() => {});
 
   const onSubmit = (data) => {
killedBy: RecommendationRequestForm tests that the options are filled correctly
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 2
Received number of calls: 0

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] BlockStatement
main/components/RecommendationRequest/RecommendationRequestForm.js:35:39
 
   //queries endpoint to get list of professors
   useEffect(() => {
-    const getProfessors = async () => {
-      try {
-        const response = await fetch("/api/admin/users/professors");
-        const data = await response.json();
-        setProfessors(data);
-      } catch (error) {
-        console.error("Error fetching professors");
-      }
-    };
+    const getProfessors = async () => {};
     const getRequestTypes = async () => {
       try {
killedBy: RecommendationRequestForm tests that the options are filled correctly
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/api/admin/users/professors"
Received
       1: "/api/requesttypes/all"
       2: "/api/requesttypes/all"

Number of calls: 2

[Killed] BlockStatement
main/components/RecommendationRequest/RecommendationRequestForm.js:36:11
   //queries endpoint to get list of professors
   useEffect(() => {
     const getProfessors = async () => {
-      try {
-        const response = await fetch("/api/admin/users/professors");
-        const data = await response.json();
-        setProfessors(data);
-      } catch (error) {
+      try {} catch (error) {
         console.error("Error fetching professors");
       }
killedBy: RecommendationRequestForm tests that the options are filled correctly
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/api/admin/users/professors"
Received
       1: "/api/requesttypes/all"
       2: "/api/requesttypes/all"

Number of calls: 2

[Killed] BlockStatement
main/components/RecommendationRequest/RecommendationRequestForm.js:40:23
         const response = await fetch("/api/admin/users/professors");
         const data = await response.json();
         setProfessors(data);
-      } catch (error) {
-        console.error("Error fetching professors");
-      }
+      } catch (error) {}
     };
     const getRequestTypes = async () => {
killedBy: RecommendationRequestForm tests that the correct error appears when the gets are called for the options
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Error fetching professors"
Received: "Error fetching request types"

Number of calls: 1

Ignored nodes: comments, script, style

[Killed] BlockStatement
main/components/RecommendationRequest/RecommendationRequestForm.js:44:41
         console.error("Error fetching professors");
       }
     };
-    const getRequestTypes = async () => {
-      try {
-        const response = await fetch("/api/requesttypes/all");
-        const data = await response.json();
-        setRecommendationTypes(data);
-      } catch (error) {
-        console.error("Error fetching request types");
-      }
-    };
+    const getRequestTypes = async () => {};
 
     getProfessors();
killedBy: StudentProfileEditPage tests tests where backend is working normally Is populated with the data provided and submits updated data
statusReason: Error: expect(element).toHaveValue(Other)

Expected the element to have value:
  Other
Received:
  undefined

[Killed] BlockStatement
main/components/RecommendationRequest/RecommendationRequestForm.js:45:11
       }
     };
     const getRequestTypes = async () => {
-      try {
-        const response = await fetch("/api/requesttypes/all");
-        const data = await response.json();
-        setRecommendationTypes(data);
-      } catch (error) {
+      try {} catch (error) {
         console.error("Error fetching request types");
       }
killedBy: RecommendationRequestForm tests that the options are filled correctly
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/api/requesttypes/all"
Received
       1: "/api/admin/users/professors"
       2: "/api/admin/users/professors"

Number of calls: 2

[Killed] BlockStatement
main/components/RecommendationRequest/RecommendationRequestForm.js:49:23
         const response = await fetch("/api/requesttypes/all");
         const data = await response.json();
         setRecommendationTypes(data);
-      } catch (error) {
-        console.error("Error fetching request types");
-      }
+      } catch (error) {}
     };
 
killedBy: RecommendationRequestForm tests that the correct error appears when the gets are called for the options
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Error fetching request types"
Received: "Error fetching professors"

Number of calls: 1

Ignored nodes: comments, script, style

[Killed] StringLiteral
main/components/RecommendationRequest/RecommendationRequestForm.js:50:23
         const data = await response.json();
         setRecommendationTypes(data);
       } catch (error) {
-        console.error("Error fetching request types");
+        console.error("");
       }
     };
killedBy: RecommendationRequestForm tests that the correct error appears when the gets are called for the options
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Error fetching request types"
Received
       1: ""
       2: "Error fetching professors"

Number of calls: 2

[Killed] BlockStatement
main/components/RecommendationRequest/RecommendationRequestForm.js:58:30
     getRequestTypes();
   });
 
-  const onSubmit = (data) => {
-    data.dueDate = data.dueDate + "T00:00:00";
-    submitAction(data);
-  };
+  const onSubmit = (data) => {};
 
   const navigate = useNavigate();
killedBy: RecommendationRequestForm tests submitAction is called with correctly formatted dueDate
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"dueDate": "2025-05-19T00:00:00"}

Number of calls: 0

Ignored nodes: comments, script, style
<html>

[Killed] LogicalOperator
main/components/RecommendationRequest/RecommendationRequestForm.js:73:10
   return (
     <Form onSubmit={handleSubmit(onSubmit)}>
       <Row>
-        {initialContents && (
-          <Col>
-            <Form.Group className="mb-3">
-              <Form.Label htmlFor="id">Id</Form.Label>
-              <Form.Control
-                data-testid="RecommendationRequestForm-id"
-                id="id"
-                type="text"
-                {...register("id")}
-                value={initialContents.id}
-                disabled
-              />
-            </Form.Group>
-          </Col>
-        )}
+        {initialContents || <Col>
+            <Form.Group className="mb-3">
+              <Form.Label htmlFor="id">Id</Form.Label>
+              <Form.Control data-testid="RecommendationRequestForm-id" id="id" type="text" {...register("id")} value={initialContents.id} disabled />
+            </Form.Group>
+          </Col>}
         <Col>
           <Form.Group className="mb-3">
killedBy: RecommendationRequestForm tests renders correctly with no initialContents
statusReason: TypeError: Cannot read properties of undefined (reading 'id')

[Killed] StringLiteral
main/components/RecommendationRequest/RecommendationRequestForm.js:106:30
                 id="professor_id"
                 type="string"
                 isInvalid={Boolean(errors.professor_id)}
-                {...register("professor_id", {
+                {...register("", {
                   required: "Please select a professor",
                 })}
killedBy: RecommendationRequestForm tests renders correctly with no initialContents
statusReason: TypeError: Cannot read properties of undefined (reading '_f')

[Killed] ConditionalExpression
main/components/RecommendationRequest/RecommendationRequestForm.js:111:47
                 })}
                 defaultValue=""
               >
-                {Array.isArray(professors) && professors.length > 0 ? (
+                {Array.isArray(professors) && true ? (
                   <>
                     <option disabled value="">
killedBy: RecommendationRequestForm tests that the initial value of professors and recommendationTypes is only defaults
statusReason: TestingLibraryElementError: Unable to find an element with the text: No professors available. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ConditionalExpression
main/components/RecommendationRequest/RecommendationRequestForm.js:111:18
                 })}
                 defaultValue=""
               >
-                {Array.isArray(professors) && professors.length > 0 ? (
+                {true ? (
                   <>
                     <option disabled value="">
killedBy: RecommendationRequestForm tests that the initial value of professors and recommendationTypes is only defaults
statusReason: TestingLibraryElementError: Unable to find an element with the text: No professors available. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ArrowFunction
main/components/RecommendationRequest/RecommendationRequestForm.js:116:37
                     <option disabled value="">
                       Select a professor
                     </option>
-                    {professors.map((professor) => (
-                      <option key={professor.id} value={professor.id}>
-                        {professor.fullName}
-                      </option>
-                    ))}
+                    {professors.map(() => undefined)}
                   </>
                 ) : (
killedBy: RecommendationRequestForm tests that the options are filled correctly
statusReason: Error: Unable to find an element with the text: Craig Zzyxx. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ConditionalExpression
main/components/RecommendationRequest/RecommendationRequestForm.js:129:14
                 )}
               </Form.Select>
             </OverlayTrigger>
-            {errors.professor_id && (
-              <Form.Control.Feedback type="invalid">
-                {errors.professor_id.message}
-              </Form.Control.Feedback>
-            )}
+            {false}
           </Form.Group>
         </Col>
killedBy: RecommendationRequestForm tests that the correct validations are performed
statusReason: Error: Unable to find an element with the text: /Please select a professor/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] LogicalOperator
main/components/RecommendationRequest/RecommendationRequestForm.js:129:14
                 )}
               </Form.Select>
             </OverlayTrigger>
-            {errors.professor_id && (
-              <Form.Control.Feedback type="invalid">
-                {errors.professor_id.message}
-              </Form.Control.Feedback>
-            )}
+            {errors.professor_id || <Form.Control.Feedback type="invalid">
+                {errors.professor_id.message}
+              </Form.Control.Feedback>}
           </Form.Group>
         </Col>
killedBy: RecommendationRequestForm tests renders correctly with no initialContents
statusReason: TypeError: Cannot read properties of undefined (reading 'message')

[Killed] StringLiteral
main/components/RecommendationRequest/RecommendationRequestForm.js:158:30
                 id="recommendationType"
                 type="string"
                 isInvalid={Boolean(errors.recommendationType)}
-                {...register("recommendationType", {
+                {...register("", {
                   required: "Please select a recommendation type",
                 })}
killedBy: RecommendationRequestForm tests renders correctly with no initialContents
statusReason: TypeError: Cannot read properties of undefined (reading '_f')

[Killed] ObjectLiteral
main/components/RecommendationRequest/RecommendationRequestForm.js:158:52
                 id="recommendationType"
                 type="string"
                 isInvalid={Boolean(errors.recommendationType)}
-                {...register("recommendationType", {
-                  required: "Please select a recommendation type",
-                })}
+                {...register("recommendationType", {})}
                 defaultValue=""
               >
killedBy: RecommendationRequestForm tests that the correct validations are performed
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Please select a recommendation type/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ConditionalExpression
main/components/RecommendationRequest/RecommendationRequestForm.js:163:18
                 })}
                 defaultValue=""
               >
-                {Array.isArray(recommendationTypes) &&
-                recommendationTypes.length > 0 ? (
+                {false ? (
                   <>
                     <option disabled value="">
killedBy: StudentProfileEditPage tests tests where backend is working normally Is populated with the data provided and submits updated data
statusReason: Error: expect(element).toHaveValue(Other)

Expected the element to have value:
  Other
Received:
  undefined

[Killed] LogicalOperator
main/components/RecommendationRequest/RecommendationRequestForm.js:163:18
                 })}
                 defaultValue=""
               >
-                {Array.isArray(recommendationTypes) &&
-                recommendationTypes.length > 0 ? (
+                {Array.isArray(recommendationTypes) || recommendationTypes.length > 0 ? (
                   <>
                     <option disabled value="">
killedBy: StudentProfileEditPage tests tests where backend is working normally Is populated with the data provided and submits updated data
statusReason: Error: expect(element).toHaveValue(Other)

Expected the element to have value:
  Other
Received:
  CS Department BS/MS program

[Killed] ConditionalExpression
main/components/RecommendationRequest/RecommendationRequestForm.js:164:17
                 defaultValue=""
               >
                 {Array.isArray(recommendationTypes) &&
-                recommendationTypes.length > 0 ? (
+                true ? (
                   <>
                     <option disabled value="">
killedBy: RecommendationRequestForm tests that the initial value of professors and recommendationTypes is only defaults
statusReason: TestingLibraryElementError: Unable to find an element with the text: No recommendation types available, use Other in details. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] EqualityOperator
main/components/RecommendationRequest/RecommendationRequestForm.js:164:17
                 defaultValue=""
               >
                 {Array.isArray(recommendationTypes) &&
-                recommendationTypes.length > 0 ? (
+                recommendationTypes.length <= 0 ? (
                   <>
                     <option disabled value="">
killedBy: RecommendationRequestForm tests that the options are filled correctly
statusReason: Error: Unable to find an element with the text: CS Department BS/MS program. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ArrowFunction
main/components/RecommendationRequest/RecommendationRequestForm.js:169:46
                     <option disabled value="">
                       Select a recommendation type
                     </option>
-                    {recommendationTypes.map((recommendationType) => (
-                      <option
-                        key={recommendationType.id}
-                        value={recommendationType.requestType}
-                      >
-                        {recommendationType.requestType}
-                      </option>
-                    ))}
+                    {recommendationTypes.map(() => undefined)}
                   </>
                 ) : (
killedBy: RecommendationRequestForm tests that the options are filled correctly
statusReason: Error: Unable to find an element with the text: CS Department BS/MS program. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ConditionalExpression
main/components/RecommendationRequest/RecommendationRequestForm.js:186:14
                 <option value="Other">Other</option>
               </Form.Select>
             </OverlayTrigger>
-            {errors.recommendationType && (
-              <Form.Control.Feedback type="invalid">
-                {errors.recommendationType.message}
-              </Form.Control.Feedback>
-            )}
+            {false}
           </Form.Group>
         </Col>
killedBy: RecommendationRequestForm tests that the correct validations are performed
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Please select a recommendation type/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ConditionalExpression
main/components/RecommendationRequest/RecommendationRequestForm.js:186:14
                 <option value="Other">Other</option>
               </Form.Select>
             </OverlayTrigger>
-            {errors.recommendationType && (
-              <Form.Control.Feedback type="invalid">
-                {errors.recommendationType.message}
-              </Form.Control.Feedback>
-            )}
+            {true}
           </Form.Group>
         </Col>
killedBy: RecommendationRequestForm tests that the correct validations are performed
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Please select a recommendation type/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/RecommendationRequest/RecommendationRequestForm.js:239:30
                 type="date"
                 data-testid="RecommendationRequestForm-dueDate"
                 isInvalid={Boolean(errors.dueDate)}
-                {...register("dueDate", {
+                {...register("", {
                   required: "Please select a due date",
                 })}
killedBy: RecommendationRequestForm tests renders correctly with no initialContents
statusReason: TypeError: Cannot read properties of undefined (reading '_f')

[Killed] StringLiteral
main/components/RecommendationRequest/RecommendationRequestForm.js:240:29
                 data-testid="RecommendationRequestForm-dueDate"
                 isInvalid={Boolean(errors.dueDate)}
                 {...register("dueDate", {
-                  required: "Please select a due date",
+                  required: "",
                 })}
               />
killedBy: RecommendationRequestForm tests that the correct validations are performed
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Please select a due date/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] LogicalOperator
main/components/RecommendationRequest/RecommendationRequestForm.js:244:14
                 })}
               />
             </OverlayTrigger>
-            {errors.dueDate && (
-              <Form.Control.Feedback type="invalid">
-                {errors.dueDate.message}
-              </Form.Control.Feedback>
-            )}
+            {errors.dueDate || <Form.Control.Feedback type="invalid">
+                {errors.dueDate.message}
+              </Form.Control.Feedback>}
           </Form.Group>
         </Col>
killedBy: RecommendationRequestForm tests renders correctly with no initialContents
statusReason: TypeError: Cannot read properties of undefined (reading 'message')

[Killed] ConditionalExpression
main/components/RecommendationRequest/RecommendationRequestForm.js:244:14
                 })}
               />
             </OverlayTrigger>
-            {errors.dueDate && (
-              <Form.Control.Feedback type="invalid">
-                {errors.dueDate.message}
-              </Form.Control.Feedback>
-            )}
+            {false}
           </Form.Group>
         </Col>
killedBy: RecommendationRequestForm tests that the correct validations are performed
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Please select a due date/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >
