[Killed] BooleanLiteral
main/pages/StudentProfile/StudentProfileCreatePage.js:7:64
 import { useBackendMutation } from "main/utils/useBackend";
 import { toast } from "react-toastify";
 
-export default function StudentProfileCreatePage({ storybook = false }) {
+export default function StudentProfileCreatePage({ storybook = true }) {
   const objectToAxiosParams = (recommendationrequest) => ({
     url: "/api/recommendationrequest/post",
killedBy: StudentProfileCreatePage tests on submit, makes request to backend, and redirects to /requests
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"to": "/requests"}

Number of calls: 0

[Killed] ArrowFunction
main/pages/StudentProfile/StudentProfileCreatePage.js:8:31
 import { toast } from "react-toastify";
 
 export default function StudentProfileCreatePage({ storybook = false }) {
-  const objectToAxiosParams = (recommendationrequest) => ({
-    url: "/api/recommendationrequest/post",
-    method: "POST",
-    params: {
-      professorId: recommendationrequest.professor_id,
-      recommendationType: recommendationrequest.recommendationType,
-      details: recommendationrequest.details,
-      dueDate: recommendationrequest.dueDate,
-    },
-  });
+  const objectToAxiosParams = () => undefined;
 
   const onSuccess = (recommendationrequest) => {
killedBy: StudentProfileCreatePage tests on submit, makes request to backend, and redirects to /requests
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] StringLiteral
main/pages/StudentProfile/StudentProfileCreatePage.js:10:13
 export default function StudentProfileCreatePage({ storybook = false }) {
   const objectToAxiosParams = (recommendationrequest) => ({
     url: "/api/recommendationrequest/post",
-    method: "POST",
+    method: "",
     params: {
       professorId: recommendationrequest.professor_id,
killedBy: StudentProfileCreatePage tests on submit, makes request to backend, and redirects to /requests
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] BlockStatement
main/pages/StudentProfile/StudentProfileCreatePage.js:19:48
     },
   });
 
-  const onSuccess = (recommendationrequest) => {
-    toast(
-      `New Recommendation Request Created - id: ${recommendationrequest.id}`,
-    );
-  };
+  const onSuccess = (recommendationrequest) => {};
 
   const mutation = useBackendMutation(
killedBy: StudentProfileCreatePage tests on submit, makes request to backend, and redirects to /requests
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "New Recommendation Request Created - id: 3"

Number of calls: 0

[Killed] BlockStatement
main/pages/StudentProfile/StudentProfileCreatePage.js:38:32
     mutation.mutate(data);
   };
 
-  if (isSuccess && !storybook) {
-    return <Navigate to="/requests" />;
-  }
+  if (isSuccess && !storybook) {}
 
   return (
killedBy: StudentProfileCreatePage tests on submit, makes request to backend, and redirects to /requests
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"to": "/requests"}

Number of calls: 0
