[Killed] BooleanLiteral
main/pages/StudentProfile/StudentProfileEditPage.js:8:62
 import { useBackend, useBackendMutation } from "main/utils/useBackend";
 import { toast } from "react-toastify";
 
-export default function StudentProfileEditPage({ storybook = false }) {
+export default function StudentProfileEditPage({ storybook = true }) {
   let { id } = useParams();
 
killedBy: StudentProfileEditPage tests tests where backend is working normally Is populated with the data provided and submits updated data
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"to": "/requests"}

Number of calls: 0

[Killed] StringLiteral
main/pages/StudentProfile/StudentProfileEditPage.js:21:12
     {
       // Stryker disable next-line all : GET is the default, so mutating this to "" doesn't introduce a bug
       method: "GET",
-      url: `/api/recommendationrequest`,
+      url: ``,
       params: {
         id,
killedBy: StudentProfileEditPage tests tests where backend is working normally Is populated with the data provided and submits updated data
statusReason: Error: Unable to find an element with the display value: Craig Zzyxx.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ObjectLiteral
main/pages/StudentProfile/StudentProfileEditPage.js:22:15
       // Stryker disable next-line all : GET is the default, so mutating this to "" doesn't introduce a bug
       method: "GET",
       url: `/api/recommendationrequest`,
-      params: {
-        id,
-      },
+      params: {},
     },
   );
killedBy: StudentProfileEditPage tests tests where backend is working normally Is populated with the data provided and submits updated data
statusReason: Error: Unable to find an element with the display value: Craig Zzyxx.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ArrowFunction
main/pages/StudentProfile/StudentProfileEditPage.js:28:34
     },
   );
 
-  const objectToAxiosPutParams = (recommendationrequest) => ({
-    url: "/api/recommendationrequest",
-    method: "PUT",
-    params: {
-      id: recommendationrequest.id,
-    },
-    data: {
-      professorId: recommendationrequest.professor_id,
-      recommendationType: recommendationrequest.recommendationType,
-      details: recommendationrequest.details,
-      dueDate: recommendationrequest.dueDate,
-    },
-  });
+  const objectToAxiosPutParams = () => undefined;
 
   const onSuccess = (recommendationrequest) => {
killedBy: StudentProfileEditPage tests tests where backend is working normally Is populated with the data provided and submits updated data
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Recommendation Request Updated - id: 17"
Received
       1: "Axios Error: Error: Request failed with status code 404"
       2: "Error: Request failed with status code 404"

Number of calls: 2

[Killed] ObjectLiteral
main/pages/StudentProfile/StudentProfileEditPage.js:28:62
     },
   );
 
-  const objectToAxiosPutParams = (recommendationrequest) => ({
-    url: "/api/recommendationrequest",
-    method: "PUT",
-    params: {
-      id: recommendationrequest.id,
-    },
-    data: {
-      professorId: recommendationrequest.professor_id,
-      recommendationType: recommendationrequest.recommendationType,
-      details: recommendationrequest.details,
-      dueDate: recommendationrequest.dueDate,
-    },
-  });
+  const objectToAxiosPutParams = (recommendationrequest) => ({});
 
   const onSuccess = (recommendationrequest) => {
killedBy: StudentProfileEditPage tests tests where backend is working normally Is populated with the data provided and submits updated data
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Recommendation Request Updated - id: 17"
Received
       1: "Axios Error: Error: Request failed with status code 404"
       2: "Error: Request failed with status code 404"

Number of calls: 2

[Killed] StringLiteral
main/pages/StudentProfile/StudentProfileEditPage.js:30:13
 
   const objectToAxiosPutParams = (recommendationrequest) => ({
     url: "/api/recommendationrequest",
-    method: "PUT",
+    method: "",
     params: {
       id: recommendationrequest.id,
killedBy: StudentProfileEditPage tests tests where backend is working normally Is populated with the data provided and submits updated data
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] BlockStatement
main/pages/StudentProfile/StudentProfileEditPage.js:42:48
     },
   });
 
-  const onSuccess = (recommendationrequest) => {
-    toast(`Recommendation Request Updated - id: ${recommendationrequest.id}`);
-  };
+  const onSuccess = (recommendationrequest) => {};
 
   const mutation = useBackendMutation(
killedBy: StudentProfileEditPage tests tests where backend is working normally Is populated with the data provided and submits updated data
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Recommendation Request Updated - id: 17"

Number of calls: 0

Ignored nodes: comments, script, style
<html>

[Killed] StringLiteral
main/pages/StudentProfile/StudentProfileEditPage.js:43:11
   });
 
   const onSuccess = (recommendationrequest) => {
-    toast(`Recommendation Request Updated - id: ${recommendationrequest.id}`);
+    toast(``);
   };
 
killedBy: StudentProfileEditPage tests tests where backend is working normally Is populated with the data provided and submits updated data
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Recommendation Request Updated - id: 17"
Received: ""

Number of calls: 1

Ignored nodes: comments, script, style

[Killed] LogicalOperator
main/pages/StudentProfile/StudentProfileEditPage.js:67:10
     <BasicLayout>
       <div className="pt-2">
         <h1>Edit Recommendation Request</h1>
-        {recommendationrequests && (
-          <RecommendationRequestForm
-            submitAction={onSubmit}
-            buttonLabel={"Update"}
-            initialContents={{
-              ...recommendationrequests,
-              professor_id: recommendationrequests.professor.id,
-              dueDate: recommendationrequests.dueDate.substring(0, 10),
-            }}
-          />
-        )}
+        {recommendationrequests || <RecommendationRequestForm submitAction={onSubmit} buttonLabel={"Update"} initialContents={{
+  ...recommendationrequests,
+  professor_id: recommendationrequests.professor.id,
+  dueDate: recommendationrequests.dueDate.substring(0, 10)
+}} />}
       </div>
     </BasicLayout>
killedBy: StudentProfileEditPage tests when the backend doesn't return data renders header but table is not present
statusReason: TypeError: Cannot read properties of undefined (reading 'professor')

[Killed] ConditionalExpression
main/pages/StudentProfile/StudentProfileEditPage.js:67:10
     <BasicLayout>
       <div className="pt-2">
         <h1>Edit Recommendation Request</h1>
-        {recommendationrequests && (
-          <RecommendationRequestForm
-            submitAction={onSubmit}
-            buttonLabel={"Update"}
-            initialContents={{
-              ...recommendationrequests,
-              professor_id: recommendationrequests.professor.id,
-              dueDate: recommendationrequests.dueDate.substring(0, 10),
-            }}
-          />
-        )}
+        {false}
       </div>
     </BasicLayout>
killedBy: StudentProfileEditPage tests tests where backend is working normally Is populated with the data provided and submits updated data
statusReason: Error: Unable to find an element with the display value: Craig Zzyxx.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] MethodExpression
main/pages/StudentProfile/StudentProfileEditPage.js:74:24
             initialContents={{
               ...recommendationrequests,
               professor_id: recommendationrequests.professor.id,
-              dueDate: recommendationrequests.dueDate.substring(0, 10),
+              dueDate: recommendationrequests.dueDate,
             }}
           />
killedBy: StudentProfileEditPage tests tests where backend is working normally Is populated with the data provided and submits updated data
statusReason: Error: expect(element).toHaveValue(2025-06-01)

Expected the element to have value:
  2025-06-01
Received:
