[Killed] StringLiteral
main/pages/StudentProfile/StudentProfileIndexPage.js:19:15
   } = useBackend(
     // Stryker disable next-line all : don't test internal caching of React Query
     ["/api/recommendationrequest/requester/all"],
-    { method: "GET", url: "/api/recommendationrequest/requester/all" },
+    { method: "", url: "/api/recommendationrequest/requester/all" },
     // Stryker disable next-line all : don't test default value of empty list
     [],
killedBy: StudentProfileIndexPage tests renders empty table when backend unavailable, user only
statusReason: Error: expect(received).toMatch(expected)

Expected substring: "Error communicating with backend via GET on /api/recommendationrequest/requester/all"
Received string:    "Error communicating with backend via  on /api/recommendationrequest/requester/all"

[Killed] BlockStatement
main/pages/StudentProfile/StudentProfileIndexPage.js:24:30
     [],
   );
 
-  const createButton = () => {
-    return (
-      <Button
-        variant="primary"
-        href="/requests/create"
-        style={{ float: "right" }}
-      >
-        Create a new Recommendation Request
-      </Button>
-    );
-  };
+  const createButton = () => {};
 
   return (
killedBy: StudentProfileIndexPage tests Renders with Create Button for student user
statusReason: Error: Unable to find an element with the text: /Create a new Recommendation Request/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] StringLiteral
main/pages/StudentProfile/StudentProfileIndexPage.js:41:58
       <div className="pt-2">
         {createButton()}
         <h1>My Requests</h1>
-        <div data-testid="left-div" style={{ marginLeft: "-180px" }}>
+        <div data-testid="left-div" style={{ marginLeft: "" }}>
           <div data-testid="top-div" style={{ marginTop: "40px" }}>
             <RecommendationRequestTable
killedBy: StudentProfileIndexPage tests outer and inner div have correct styles
statusReason: Error: expect(element).toHaveStyle()

- Expected

- margin-left: -180px;
