[Killed] StringLiteral
main/components/RequestType/RequestTypeForm.js:47:27
               type="text"
               isInvalid={Boolean(errors.requestType)}
               {...register("requestType", {
-                required: "Please enter a valid Request Type.",
+                required: "",
                 maxLength: {
                   value: 255,
killedBy: RequestTypeForm tests correct error messsages on missing input
statusReason: TypeError: e is not a function

[Killed] StringLiteral
main/components/RequestType/RequestTypeForm.js:50:28
                 required: "Please enter a valid Request Type.",
                 maxLength: {
                   value: 255,
-                  message: "Request Type cannot exceed 255 characters.",
+                  message: "",
                 },
               })}
killedBy: RequestTypeForm tests correct Error messsages on bad input
statusReason: Error: Unable to find an element with the text: /Request Type cannot exceed 255 characters./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >
