[Killed] BlockStatement
src/main/pages/AdminRequestsPage.js:5:33
 import RecommendationRequestTable from "main/components/RecommendationRequest/RecommendationRequestTable";
 
 import { useBackend } from "main/utils/useBackend";
-const AdminRequestsPage = () => {
-  const {
-    data: requests,
-    error: _error,
-    status: _status,
-  } = useBackend(
-    // Stryker disable next-line all : don't test internal caching of React Query
-    ["/api/recommendationrequest/admin/all"],
-    { method: "GET", url: "/api/recommendationrequest/admin/all" },
-    [],
-  );
-
-  return (
-    <BasicLayout>
-      <h2>Requests</h2>
-      <RecommendationRequestTable requests={requests} />
-    </BasicLayout>
-  );
-};
+const AdminRequestsPage = () => {};
 
 export default AdminRequestsPage;
killedBy: AdminRecommendationRequestsPage tests renders without crashing on three requests
statusReason: Error: Unable to find an element with the text: Requests. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>
