[Killed] BooleanLiteral
main/pages/RequestTypes/RequestTypesCreatePage.js:7:62
 import { useBackendMutation } from "main/utils/useBackend";
 import { toast } from "react-toastify";
 
-export default function RequestTypesCreatePage({ storybook = false }) {
+export default function RequestTypesCreatePage({ storybook = true }) {
   const objectToAxiosParams = (requestTypes) => ({
     url: "/api/requesttypes/post",
killedBy: RequestTypesCreatePage tests on submit, makes request to backend, and redirects to /settings/requesttypes
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"to": "/settings/requesttypes"}

Number of calls: 0

[Killed] ArrowFunction
main/pages/RequestTypes/RequestTypesCreatePage.js:8:31
 import { toast } from "react-toastify";
 
 export default function RequestTypesCreatePage({ storybook = false }) {
-  const objectToAxiosParams = (requestTypes) => ({
-    url: "/api/requesttypes/post",
-    method: "POST",
-    params: {
-      requestType: requestTypes.requestType,
-    },
-  });
+  const objectToAxiosParams = () => undefined;
 
   const onSuccess = (requestTypes) => {
killedBy: RequestTypesCreatePage tests on submit, makes request to backend, and redirects to /settings/requesttypes
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] StringLiteral
main/pages/RequestTypes/RequestTypesCreatePage.js:9:10
 
 export default function RequestTypesCreatePage({ storybook = false }) {
   const objectToAxiosParams = (requestTypes) => ({
-    url: "/api/requesttypes/post",
+    url: "",
     method: "POST",
     params: {
killedBy: RequestTypesCreatePage tests on submit, makes request to backend, and redirects to /settings/requesttypes
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "New Request Type Created - id: 123 requestType: University Transfer"
Received: "Axios Error: Error: Request failed with status code 404"

Number of calls: 1

[Killed] ObjectLiteral
main/pages/RequestTypes/RequestTypesCreatePage.js:11:13
   const objectToAxiosParams = (requestTypes) => ({
     url: "/api/requesttypes/post",
     method: "POST",
-    params: {
-      requestType: requestTypes.requestType,
-    },
+    params: {},
   });
 
killedBy: RequestTypesCreatePage tests on submit, makes request to backend, and redirects to /settings/requesttypes
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Object {
-   "requestType": "University Transfer",
- }

[Killed] BlockStatement
main/pages/RequestTypes/RequestTypesCreatePage.js:16:39
     },
   });
 
-  const onSuccess = (requestTypes) => {
-    toast(
-      `New Request Type Created - id: ${requestTypes.id} requestType: ${requestTypes.requestType}`,
-    );
-  };
+  const onSuccess = (requestTypes) => {};
 
   const onError = (error) => {
killedBy: RequestTypesCreatePage tests on submit, makes request to backend, and redirects to /settings/requesttypes
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "New Request Type Created - id: 123 requestType: University Transfer"

Number of calls: 0

[Killed] StringLiteral
main/pages/RequestTypes/RequestTypesCreatePage.js:18:7
 
   const onSuccess = (requestTypes) => {
     toast(
-      `New Request Type Created - id: ${requestTypes.id} requestType: ${requestTypes.requestType}`,
+      ``,
     );
   };
killedBy: RequestTypesCreatePage tests on submit, makes request to backend, and redirects to /settings/requesttypes
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "New Request Type Created - id: 123 requestType: University Transfer"
Received: ""

Number of calls: 1
