[Killed] BlockStatement
main/pages/RequestTypes/RequestTypesIndexPage.js:3:49
 import BasicLayout from "main/layouts/BasicLayout/BasicLayout";
 
-export default function RequestTypesIndexPage() {
-  // Stryker disable all : placeholder for future implementation
-  return (
-    <BasicLayout>
-      <div className="pt-2">
-        <h1>Request Types Index page not yet implemented</h1>
-        <p>
-          <a href="/settings/requesttypes/create">Create</a>
-        </p>
-        <p>
-          <a href="/settings/requesttypes/edit">Edit</a>
-        </p>
-      </div>
-    </BasicLayout>
-  );
-}
+export default function RequestTypesIndexPage() {}
 
killedBy: RequestTypesIndexPage tests Renders expected content
statusReason: Error: Unable to find an element with the text: Request Types Index page not yet implemented. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>
