[Killed] BlockStatement
src/main/pages/SettingsPage.js:3:40
 import BasicLayout from "main/layouts/BasicLayout/BasicLayout";
 
-export default function SettingsPage() {
-  // Stryker disable all : placeholder for future implementation
-  return (
-    <BasicLayout>
-      <div className="pt-2">
-        <h1>Settings</h1>
-        <p>
-          <a href="/settings/requesttypes">Request Types</a>
-        </p>
-      </div>
-    </BasicLayout>
-  );
-}
+export default function SettingsPage() {}
 
killedBy: SettingsPage tests Renders expected content
statusReason: Error: Unable to find an element with the text: Settings. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>
